In [1]:
%load_ext autotime

In [2]:
### imports and basic setup

time: 643 µs

In [3]:
import imp # need to be done for python 3
import logging
imp.reload(logging)
logging.basicConfig(format='%(asctime)s %(levelname)s:%(message)s', 
                    level=logging.DEBUG, datefmt='%I:%M:%S')

time: 5.02 ms

In [4]:
import sys
import os

time: 1.14 ms

In [5]:
sys.path.append('/Users/pradap/Documents/Research/Python-Package/anhaid/magellan/')

time: 1.33 ms

In [6]:
import magellan as mg

time: 2.73 s

In [7]:
# set the scratch directory

time: 617 µs

In [8]:
scratch_dir = os.sep.join(['.', 'scratch'])

time: 826 µs

In [9]:
# Save/Load a dataframe i.e a input table (with metadata)

time: 602 µs

In [10]:
path_a = os.sep.join([mg.get_install_path(), 'datasets', 'table_A.csv'])
path_b = os.sep.join([mg.get_install_path(), 'datasets', 'table_B.csv'])

time: 2.57 ms

In [11]:
A = mg.read_csv_metadata(path_a)

time: 10.8 ms

In [12]:
A

,ID,name,birth_year,hourly_wage,address,zipcode
0,a1,Kevin Smith,1989,30.0,"607 From St, San Francisco",94107
1,a2,Michael Franklin,1988,27.5,"1652 Stockton St, San Francisco",94122
2,a3,William Bridge,1986,32.0,"3131 Webster St, San Francisco",94107
3,a4,Binto George,1987,32.5,"423 Powell St, San Francisco",94122
4,a5,Alphonse Kemper,1984,35.0,"1702 Post Street, San Francisco",94122

time: 48.7 ms

In [13]:
p = os.sep.join([scratch_dir, 'A.pkl'])
mg.save_table(A, p)

True

time: 8.18 ms

In [14]:
A1 = mg.load_table(os.sep.join([scratch_dir, 'A.pkl']))

time: 5.73 ms

In [15]:
A1

,ID,name,birth_year,hourly_wage,address,zipcode
0,a1,Kevin Smith,1989,30.0,"607 From St, San Francisco",94107
1,a2,Michael Franklin,1988,27.5,"1652 Stockton St, San Francisco",94122
2,a3,William Bridge,1986,32.0,"3131 Webster St, San Francisco",94107
3,a4,Binto George,1987,32.5,"423 Powell St, San Francisco",94122
4,a5,Alphonse Kemper,1984,35.0,"1702 Post Street, San Francisco",94122

time: 25.5 ms

In [16]:
mg.show_properties(A1)

id: 4658625224
key: ID
time: 8.32 ms

In [17]:
# Write/Read a candidate set (with metadata)

time: 890 µs

In [18]:
A = mg.read_csv_metadata(path_a)
B = mg.read_csv_metadata(path_b)

time: 20 ms

In [19]:
ab = mg.AttrEquivalenceBlocker()
C = ab.block_tables(A, B, 'zipcode', 'zipcode', l_output_attrs=['name', 'zipcode'],
                   r_output_attrs=['name', 'zipcode'], n_jobs=-1)

0%  100%
[#####] | ETA: 00:00:00

time: 250 ms

Total time elapsed: 00:00:00

In [20]:
C

,_id,ltable_ID,rtable_ID,ltable_name,ltable_zipcode,rtable_name,rtable_zipcode
0,0,a1,b1,Kevin Smith,94107,Mark Levene,94107
1,1,a1,b2,Kevin Smith,94107,Bill Bridge,94107
2,2,a3,b1,William Bridge,94107,Mark Levene,94107
3,3,a3,b2,William Bridge,94107,Bill Bridge,94107
4,4,a2,b3,Michael Franklin,94122,Mike Franklin,94122
5,5,a1,b6,Kevin Smith,94107,Michael Brodie,94107
6,6,a3,b6,William Bridge,94107,Michael Brodie,94107
7,7,a2,b4,Michael Franklin,94122,Joseph Kuan,94122
8,8,a2,b5,Michael Franklin,94122,Alfons Kemper,94122
9,9,a4,b3,Binto George,94122,Mike Franklin,94122
10,10,a5,b3,Alphonse Kemper,94122,Mike Franklin,94122
11,11,a4,b4,Binto George,94122,Joseph Kuan,94122
12,12,a4,b5,Binto George,94122,Alfons Kemper,94122
13,13,a5,b4,Alphonse Kemper,94122,Joseph Kuan,94122
14,14,a5,b5,Alphonse Kemper,94122,Alfons Kemper,94122

time: 21.2 ms

In [21]:
path_c = os.sep.join([scratch_dir, 'C.pkl'])
mg.save_table(C, path_c)

True

time: 16.4 ms

In [23]:
C1 = mg.load_table(path_c)

time: 3.18 ms

In [24]:
C1

,_id,ltable_ID,rtable_ID,ltable_name,ltable_zipcode,rtable_name,rtable_zipcode
0,0,a1,b1,Kevin Smith,94107,Mark Levene,94107
1,1,a1,b2,Kevin Smith,94107,Bill Bridge,94107
2,2,a3,b1,William Bridge,94107,Mark Levene,94107
3,3,a3,b2,William Bridge,94107,Bill Bridge,94107
4,4,a2,b3,Michael Franklin,94122,Mike Franklin,94122
5,5,a1,b6,Kevin Smith,94107,Michael Brodie,94107
6,6,a3,b6,William Bridge,94107,Michael Brodie,94107
7,7,a2,b4,Michael Franklin,94122,Joseph Kuan,94122
8,8,a2,b5,Michael Franklin,94122,Alfons Kemper,94122
9,9,a4,b3,Binto George,94122,Mike Franklin,94122
10,10,a5,b3,Alphonse Kemper,94122,Mike Franklin,94122
11,11,a4,b4,Binto George,94122,Joseph Kuan,94122
12,12,a4,b5,Binto George,94122,Alfons Kemper,94122
13,13,a5,b4,Alphonse Kemper,94122,Joseph Kuan,94122
14,14,a5,b5,Alphonse Kemper,94122,Alfons Kemper,94122

time: 13.9 ms

In [25]:
mg.show_properties(C1)

id: 4661375328
key: _id
fk_ltable: ltable_ID
fk_rtable: rtable_ID
time: 1.26 ms

In [26]:
# save/load table with different metadata extension

time: 592 µs

In [27]:
A = mg.read_csv_metadata(path_a)

time: 4.8 ms

In [29]:
p = os.sep.join([scratch_dir, 'A.pkl'])
mg.save_table(A, p, metadata_ext='peekl')

12:52:36 WARNING:File already exists at ./scratch/A.pkl; Overwriting it

True

time: 6.89 ms

In [30]:
A2 = mg.load_table(p, metadata_ext = 'peekl')

time: 2.87 ms

In [31]:
# save/load object

time: 558 µs

In [32]:
bb = mg.BlackBoxBlocker()

time: 779 µs

In [33]:
import py_stringmatching as sm

time: 732 µs

In [41]:
def fn(ltuple, rtuple):
    x = sm.Levenshtein()
    if x.get_sim_score(ltuple['name'], rtuple['name']) > 0.5:
        return False
    else:
        return True

time: 2.28 ms

In [42]:
bb.set_black_box_function(fn)

time: 896 µs

In [43]:
A = mg.read_csv_metadata(path_a)
B = mg.read_csv_metadata(path_b)

time: 8.25 ms

In [45]:
C = bb.block_tables(A, B, l_output_attrs=['name', 'zipcode'], 
                    r_output_attrs=['name', 'zipcode'], 
                   n_jobs=-1)

0%  100%
[######] | ETA: 00:00:00
Total time elapsed: 00:00:00

time: 227 ms

In [46]:
C

,_id,ltable_ID,rtable_ID,ltable_name,ltable_zipcode,rtable_name,rtable_zipcode
0,0,a2,b3,Michael Franklin,94122,Mike Franklin,94122
1,1,a3,b2,William Bridge,94107,Bill Bridge,94107
2,2,a2,b6,Michael Franklin,94122,Michael Brodie,94107
3,3,a5,b5,Alphonse Kemper,94122,Alfons Kemper,94122

time: 12.1 ms

In [48]:
p = os.sep.join([scratch_dir, 'bb.pkl'])
mg.save_object(bb, p)

True

time: 4.91 ms

In [49]:
bb1 = mg.load_object(p)

time: 1.46 ms

In [53]:
C1 = bb1.block_tables(A, B, l_output_attrs=['name', 'zipcode'], 
                    r_output_attrs=['name', 'zipcode'])

0%                          100%
[##############################] | ETA: 00:00:00

time: 46.9 ms

Total time elapsed: 00:00:00

In [54]:
C1

,_id,ltable_ID,rtable_ID,ltable_name,ltable_zipcode,rtable_name,rtable_zipcode
0,0,a2,b3,Michael Franklin,94122,Mike Franklin,94122
1,1,a2,b6,Michael Franklin,94122,Michael Brodie,94107
2,2,a3,b2,William Bridge,94107,Bill Bridge,94107
3,3,a5,b5,Alphonse Kemper,94122,Alfons Kemper,94122

time: 10.9 ms